index.org
#+TITLE: Informatics basics
#+AUTHOR: Starovoytov Alexandr, Grechko Georgy
#+DATE: <2021-09-04 Sat 13:50>
#+latex_header: \usepackage[russian]{babel}
# #+latex_header: \usepackage[T2A]{fontenc}
# #+latex_header: \usepackage[colorlinks]{hyperref}

+ [[https://stewkk.github.io/infbasics/inf_basics.pdf][Лекции в pdf формате]]
+ [[https://stewkk.github.io/infbasics/][Лекции в виде сайта]]
+ Преподаватель
  - Коновалов Александр Владимирович
  - 89175404352
  - akonovalov@bmstu.ru
  - a.v.konovalov87@mail.ru
* Основные понятия информатики
** Данные
это представление фактов, понятий, инструкций в форме, приемлемой
для обмена, интерпретации или обработки человеком или с помощью
автоматических средств
** Алгоритм
это конечная совокупность точно заданных правил решения прозвольного класса
задач или набор инструкций, описывающий порядок действий исполнителя для
решения некотрой задачи
** Свойства алгоритма:
1. Дискретность \\
    делится на отдельные элементарные части,
    отвечающие за определенные действия.
2. Детерминированность \\
    на одних и тех же входных данных - один и тот же результат.
3. Понятность \\
    элементы алгоритма должны быть понятны исполнителю.
4. Завершаемость \\
    если не завершается - то это вычислительный процесс.
5. Массовость \\
    алгоритм пригоден для решения всех задач данного типа.
6. Результативность \\
    указывает на наличие таких исходных данных, для которых реализуемый
    по заданному алгоритму вычислительный процесс должен через конечное
    число шагов остановиться и выдать искомый результат.
** Компьютерная программа
это алгоритм, записанный на некотором языке программирования
** Язык программирования
формальный язык, предназначенный для записи компьютерных программ
** Компьютер
программно управляемое устройство для обработки информации
** Подпрограмма
некоторый именованный блок кода. \\
Вызывающая программа приостанавливается, управление передается
подпрограмме,
по завершению управление передается обратно
** Сопрограмма
в отличие от подпрограммы работает поочередно с вызывающей программой.
При повторном вызове возобновит выполнение с момента, где остановилась
* Парадигмы программирования
совокупность идей и понятий, определяющих стиль написания компьютерных
программ (подход к программированию). Это способ концептуализации,
определяющий организацию вычислений и структурирование работы, выполняемой
компьютером.
