index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-09 Thu 22:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Informatics basics</title>
<meta name="author" content="Starovoytov Alexandr, Grechko Georgy" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Informatics basics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf2e83d9">1. Преподаватель</a></li>
<li><a href="#orgdedc74d">2. Основные понятия информатики</a>
<ul>
<li><a href="#org655d030">2.1. Данные</a></li>
<li><a href="#orgb095ef0">2.2. Алгоритм</a></li>
<li><a href="#org7331bac">2.3. Свойства алгоритма:</a></li>
<li><a href="#org9b1da09">2.4. Компьютерная программа</a></li>
<li><a href="#orgc9d490a">2.5. Язык программирования</a></li>
<li><a href="#org1b8aa4d">2.6. Компьютер</a></li>
<li><a href="#orgb86d87b">2.7. Подпрограмма</a></li>
<li><a href="#orgcc675bd">2.8. Сопрограмма</a></li>
</ul>
</li>
<li><a href="#org45271d4">3. Парадигмы программирования</a>
<ul>
<li><a href="#orgbbf720f">3.1. Основные группы парадигм</a></li>
<li><a href="#org21e91ba">3.2. примеры</a></li>
</ul>
</li>
<li><a href="#orgdb6797f">4. Язык Scheme</a>
<ul>
<li><a href="#org5d60142">4.1. информация о языке</a></li>
<li><a href="#org422423f">4.2. основные постулаты языка LISP</a></li>
<li><a href="#org74e6f01">4.3. операторы</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2e83d9" class="outline-2">
<h2 id="orgf2e83d9"><span class="section-number-2">1.</span> Преподаватель</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Коновалов Александр Владимирович</li>
<li>89175404352</li>
<li>akonovalov@bmstu.ru</li>
<li>a.v.konovalov87@mail.ru</li>
</ul>
</div>
</div>
<div id="outline-container-orgdedc74d" class="outline-2">
<h2 id="orgdedc74d"><span class="section-number-2">2.</span> Основные понятия информатики</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org655d030" class="outline-3">
<h3 id="org655d030"><span class="section-number-3">2.1.</span> Данные</h3>
<div class="outline-text-3" id="text-2-1">
<p>
это представление фактов, понятий, инструкций в форме, приемлемой
для обмена, интерпретации или обработки человеком или с помощью
автоматических средств
</p>
</div>
</div>
<div id="outline-container-orgb095ef0" class="outline-3">
<h3 id="orgb095ef0"><span class="section-number-3">2.2.</span> Алгоритм</h3>
<div class="outline-text-3" id="text-2-2">
<p>
это конечная совокупность точно заданных правил решения прозвольного класса
задач или набор инструкций, описывающий порядок действий исполнителя для
решения некотрой задачи
</p>
</div>
</div>
<div id="outline-container-org7331bac" class="outline-3">
<h3 id="org7331bac"><span class="section-number-3">2.3.</span> Свойства алгоритма:</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Дискретность <br />
делится на отдельные элементарные части,
отвечающие за определенные действия.</li>
<li>Детерминированность <br />
на одних и тех же входных данных - один и тот же результат.</li>
<li>Понятность <br />
элементы алгоритма должны быть понятны исполнителю.</li>
<li>Завершаемость <br />
если не завершается - то это вычислительный процесс.</li>
<li>Массовость <br />
алгоритм пригоден для решения всех задач данного типа.</li>
<li>Результативность <br />
указывает на наличие таких исходных данных, для которых реализуемый
по заданному алгоритму вычислительный процесс должен через конечное
число шагов остановиться и выдать искомый результат.</li>
</ol>
</div>
</div>
<div id="outline-container-org9b1da09" class="outline-3">
<h3 id="org9b1da09"><span class="section-number-3">2.4.</span> Компьютерная программа</h3>
<div class="outline-text-3" id="text-2-4">
<p>
это алгоритм, записанный на некотором языке программирования
</p>
</div>
</div>
<div id="outline-container-orgc9d490a" class="outline-3">
<h3 id="orgc9d490a"><span class="section-number-3">2.5.</span> Язык программирования</h3>
<div class="outline-text-3" id="text-2-5">
<p>
формальный язык, предназначенный для записи компьютерных программ
</p>
</div>
</div>
<div id="outline-container-org1b8aa4d" class="outline-3">
<h3 id="org1b8aa4d"><span class="section-number-3">2.6.</span> Компьютер</h3>
<div class="outline-text-3" id="text-2-6">
<p>
программно управляемое устройство для обработки информации
</p>
</div>
</div>
<div id="outline-container-orgb86d87b" class="outline-3">
<h3 id="orgb86d87b"><span class="section-number-3">2.7.</span> Подпрограмма</h3>
<div class="outline-text-3" id="text-2-7">
<p>
некоторый именованный блок кода. <br />
Вызывающая программа приостанавливается, управление передается
подпрограмме,
по завершению управление передается обратно
</p>
</div>
</div>
<div id="outline-container-orgcc675bd" class="outline-3">
<h3 id="orgcc675bd"><span class="section-number-3">2.8.</span> Сопрограмма</h3>
<div class="outline-text-3" id="text-2-8">
<p>
в отличие от подпрограммы работает поочередно с вызывающей программой.
При повторном вызове возобновит выполнение с момента, где остановилась
</p>
</div>
</div>
</div>
<div id="outline-container-org45271d4" class="outline-2">
<h2 id="org45271d4"><span class="section-number-2">3.</span> Парадигмы программирования</h2>
<div class="outline-text-2" id="text-3">
<p>
совокупность идей и понятий, определяющих стиль написания компьютерных
программ (подход к программированию). Это способ концептуализации,
определяющий организацию вычислений и структурирование работы, выполняемой
компьютером.
</p>
</div>
