index.md

# Table of Contents

1.  [Основные понятия информатики](#org4b679af)
    1.  [Данные](#orgf033fb9)
    2.  [Алгоритм](#org3e9938f)
    3.  [Свойства алгоритма:](#orga3edcf7)
    4.  [Компьютерная программа](#orgb5fda0c)
    5.  [Язык программирования](#org095dff5)
    6.  [Компьютер](#orgb8bc1fb)
    7.  [Подпрограмма](#org3ba4e1b)
    8.  [Сопрограмма](#orgf8ce87e)
2.  [Парадигмы программирования](#org61f6d90)
    1.  [Основные группы парадигм](#org6dd2111)
    2.  [примеры](#org174a8a6)
3.  [язык Scheme](#org0ebf009)
    1.  [информация о языке](#orgf2918e3)
    2.  [основные постулаты языка LISP](#org9e87f3b)
    3.  [операторы](#org0163405)

-   [Лекции в pdf формате](https://stewkk.github.io/infbasics/inf_basics.pdf)
-   [Лекции в виде сайта](https://stewkk.github.io/infbasics/)
-   Преподаватель
    -   Коновалов Александр Владимирович
    -   89175404352
    -   akonovalov@bmstu.ru
    -   a.v.konovalov87@mail.ru


<a id="org4b679af"></a>

# Основные понятия информатики


<a id="orgf033fb9"></a>

## Данные

это представление фактов, понятий, инструкций в форме, приемлемой
для обмена, интерпретации или обработки человеком или с помощью
автоматических средств


<a id="org3e9938f"></a>

## Алгоритм

это конечная совокупность точно заданных правил решения прозвольного класса
задач или набор инструкций, описывающий порядок действий исполнителя для
решения некотрой задачи


<a id="orga3edcf7"></a>

## Свойства алгоритма:

1.  Дискретность   
    делится на отдельные элементарные части,
    отвечающие за определенные действия.
2.  Детерминированность   
    на одних и тех же входных данных - один и тот же результат.
3.  Понятность   
    элементы алгоритма должны быть понятны исполнителю.
4.  Завершаемость   
    если не завершается - то это вычислительный процесс.
5.  Массовость   
    алгоритм пригоден для решения всех задач данного типа.
6.  Результативность   
    указывает на наличие таких исходных данных, для которых реализуемый
    по заданному алгоритму вычислительный процесс должен через конечное
    число шагов остановиться и выдать искомый результат.


<a id="orgb5fda0c"></a>

## Компьютерная программа

это алгоритм, записанный на некотором языке программирования


<a id="org095dff5"></a>

## Язык программирования

формальный язык, предназначенный для записи компьютерных программ


<a id="orgb8bc1fb"></a>

## Компьютер

программно управляемое устройство для обработки информации


<a id="org3ba4e1b"></a>

## Подпрограмма

некоторый именованный блок кода.   
Вызывающая программа приостанавливается, управление передается
подпрограмме,
по завершению управление передается обратно


<a id="orgf8ce87e"></a>

## Сопрограмма

в отличие от подпрограммы работает поочередно с вызывающей программой.
При повторном вызове возобновит выполнение с момента, где остановилась


<a id="org61f6d90"></a>

# Парадигмы программирования

совокупность идей и понятий, определяющих стиль написания компьютерных
программ (подход к программированию). Это способ концептуализации,
определяющий организацию вычислений и структурирование работы, выполняемой
компьютером.
