index.html
<div id="outline-container-orgbbf720f" class="outline-3">
<h3 id="orgbbf720f"><span class="section-number-3">3.1.</span> Основные группы парадигм</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Императивные <br />
способ записи программ, в котором указывается последовательность
действий <br />
основной признак - оператор присваивания (меняющий значение переменной)
<ol class="org-ol">
<li>Структурное программирование <br />
программа является композицией блоков с одним входом и
одним выходом <br />
(есть операторы ветвления и цикла, но нет goto)</li>
<li>Процедурное программирование <br />
совокупность подпрограмм, где одни подпрограммы вызывают другие</li>
<li>Объектно-ориентированное <br />
программа рассматривается как набор некоторых взаимодействующих
объектов. <br />
Объект сочетает в себе данные и методы их обработки,
методы вызываются в ответ на сообщение: <br />
посылаем сообщение объекту -&gt; вызывает метод -&gt; возвращает ответ <br />
объекты объединяются в классы</li>
</ol></li>
<li>Декларативные <br />
способ записи программ, в котором описывается взаимосвязь между
данными, описывается цель, но не последовательность шагов ее вычисления
<ol class="org-ol">
<li><p>
Функциональное <br />
алгоритм записывается как набор взаимосвязанных функций, функции
рассматриваются с математической точки зрения, <br />
описывает взаимосвязь между данными и результатом
</p>
<div class="org-src-container">
<pre class="src src-"c"">      x = f(y) + g(z);
</pre>
</div></li>
<li>Логическое (Prolog + отчасти SQL) <br />
алгоритм описывает взаимосвязь между понятиями. <br />
Выполнение программы сводится к выполнению запросов</li>
</ol></li>
<li>Метапрограммирование <br />
метаирония. Программа рассматривается как данные/объект для
другой программы
<ol class="org-ol">
<li>Программу пишут программы <br />
Например: макросы, генераторы кода, шаблоны С++ (фигня нечитаемая
зачем он постоянно в руках часы крутит попит симпл димпл круче
нет попит симпл димпл попит симпл димпл маленький красивый
попит большой и милый)</li>
<li>Программа взаимодействует с вычислительной средой <br />
Рефлексия или интроспекция - самоанализ. <br />
Например, посмотреть поля и значения в объекте класса</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org21e91ba" class="outline-3">
<h3 id="org21e91ba"><span class="section-number-3">3.2.</span> примеры</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example" id="orgb121aed">
ИП: sort(array);
ФП: sorted_list = sort(list)
    sorted_list - константа, т.к. нет присваивания
ЛП: sort(unsorted, sorted)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdb6797f" class="outline-2">
<h2 id="orgdb6797f"><span class="section-number-2">4.</span> Язык Scheme</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5d60142" class="outline-3">
<h3 id="org5d60142"><span class="section-number-3">4.1.</span> информация о языке</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Lisp 1950-е годы Джон МакКарти <br />
LISt Processing <br />
Scheme 1970-е годы Абельсон и Сассман <br />
изучаем R5RS <br />
современная редакция R7RS
</p>
<ul class="org-ul">
<li>другие языки семейства LISP:
<ul class="org-ul">
<li>Common Lisp</li>
<li>Clojure</li>
<li>Racket</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org422423f" class="outline-3">
<h3 id="org422423f"><span class="section-number-3">4.2.</span> основные постулаты языка LISP</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>единство кода и данных</li>
<li>все есть список</li>
<li>выражение является списком <br />
операция указывается в первом элементе</li>
<li>все выражения вычисляют значения (почти все)</li>
</ol>
</div>
</div>
