index.md


<a id="org6dd2111"></a>

## Основные группы парадигм

1.  Императивные   
    способ записи программ, в котором указывается последовательность
    действий   
    основной признак - оператор присваивания (меняющий значение переменной)
    1.  Структурное программирование   
        программа является композицией блоков с одним входом и
        одним выходом   
        (есть операторы ветвления и цикла, но нет goto)
    2.  Процедурное программирование   
        совокупность подпрограмм, где одни подпрограммы вызывают другие
    3.  Объектно-ориентированное   
        программа рассматривается как набор некоторых взаимодействующих
        объектов.   
        Объект сочетает в себе данные и методы их обработки,
        методы вызываются в ответ на сообщение:   
        посылаем сообщение объекту -> вызывает метод -> возвращает ответ   
        объекты объединяются в классы
2.  Декларативные   
    способ записи программ, в котором описывается взаимосвязь между
    данными, описывается цель, но не последовательность шагов ее вычисления
    1.  Функциональное   
        алгоритм записывается как набор взаимосвязанных функций, функции
        рассматриваются с математической точки зрения,   
        описывает взаимосвязь между данными и результатом
        
            x = f(y) + g(z);
    2.  Логическое (Prolog + отчасти SQL)   
        алгоритм описывает взаимосвязь между понятиями.   
        Выполнение программы сводится к выполнению запросов
3.  Метапрограммирование   
    метаирония. Программа рассматривается как данные/объект для
    другой программы
    1.  Программу пишут программы   
        Например: макросы, генераторы кода, шаблоны С++ (фигня нечитаемая
        зачем он постоянно в руках часы крутит попит симпл димпл круче
        нет попит симпл димпл попит симпл димпл маленький красивый
        попит большой и милый)
    2.  Программа взаимодействует с вычислительной средой   
        Рефлексия или интроспекция - самоанализ.   
        Например, посмотреть поля и значения в объекте класса


<a id="org174a8a6"></a>

## примеры

    ИП: sort(array);
    ФП: sorted_list = sort(list)
        sorted_list - константа, т.к. нет присваивания
    ЛП: sort(unsorted, sorted)


<a id="org0ebf009"></a>

# язык Scheme


<a id="orgf2918e3"></a>

## информация о языке

Lisp 1950-е годы Джон МакКарти   
LISt Processing   
Scheme 1970-е годы Абельсон и Сассман   
изучаем R5RS   
современная редакция R7RS

-   другие языки семейства LISP:
    -   Common Lisp
    -   Clojure
    -   Racket


<a id="org9e87f3b"></a>

## основные постулаты языка LISP

1.  единство кода и данных
2.  все есть список
3.  выражение является списком   
    операция указывается в первом элементе
4.  все выражения вычисляют значения (почти все)
