index.org
** операторы
#+begin_src scheme :session :results value
;; <терм> ::= <атом>|<список>
;; <атом> ::= <перем>|<число>|<симол>|<строка>
;; <список> ::= (<термы>)
;; <термы> ::= <пусто> | <терм><термы>
;; <пусто> ::=
;; i-am-variable - имя переменной может включать "-", "+", "*", "/"...
(+ 1 2 3) ;; список
;; "+" - имя функции сложения
;; "1 2 3" - аргументы
;; элементы списка разделяются пробелами

#+end_src

#+RESULTS:
: 6

#+begin_src scheme :session :exports both
((a 1)(b 2)(c 3)) ;; список списков

;; по умолчанию выражение вида
;; (f a b c) - вызов функции
;; ((f x) y) - сначала вызывается (f x),
;; то, что она вычислит с аргументом y
;; Особая форма - первый элемент списка - ключевое слово

(define pi 3.1415926)
;; pi - имя переменной
;; 3.14.. - значение

(define pi (* 4 (atan 1)))

(define (f a b c) ;; опеределяет функции
    (+ (* 2 a) (/ b c)))

;; (if <выраж 1>
;;     <выраж 2>
;;     <выраж 3>)

;; Если <выраж 1> - ложь,
;; значением (if ...) станет значение <выраж3>
;; (<выраж 2> не вычисляется), и наоборот

;; #f - ложь
;; #t - истина
;; if считает истиной все что не ложь
#+end_src


#+begin_src scheme :session :exports both
(if 1 2 3)
#+end_src

#+RESULTS:
: 2

#+begin_src scheme :session :exports both
(if #f (/ 1 0) (/ 10 5))

#+end_src

#+RESULTS:
: 2

#+begin_src scheme :exports both
(if #t (/ 1 0) (/ 10 5))
#+end_src

#+RESULTS:
: Throw to key `numerical-overflow' with args `("/" "Numerical overflow" #f #f)'.

#+begin_src scheme
;; (< x y)
;; (> x y)
;; (= x y)
;; >=
;; <=
;; (/ x y)
(/ 10 3)
#+end_src

#+RESULTS:
: 10/3

#+begin_src scheme :session :export both
;; (quotient x y) - целое деление
(quotient 30 7)
#+end_src

#+RESULTS:
: 4

#+begin_src scheme :session :export both
;; (remainder x y) -> остаток
(remainder 30 7)
#+end_src

#+RESULTS:
: 2

#+begin_src scheme :session :export both
;; "особые формы"
;; (and e1 e2 ... en) - возвращает #f если хотя бы один ei = #f, иначе en
;; (or ...) - вернет первое не ложное значение


(and 1 2 #f (/ 1 0))
#+end_src

#+RESULTS:
: #f
