index.html
<div id="outline-container-org74e6f01" class="outline-3">
<h3 id="org74e6f01"><span class="section-number-3">4.3.</span> операторы</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;&#1090;&#1077;&#1088;&#1084;&gt; ::= &lt;&#1072;&#1090;&#1086;&#1084;&gt;|&lt;&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;&gt;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;&#1072;&#1090;&#1086;&#1084;&gt; ::= &lt;&#1087;&#1077;&#1088;&#1077;&#1084;&gt;|&lt;&#1095;&#1080;&#1089;&#1083;&#1086;&gt;|&lt;&#1089;&#1080;&#1084;&#1086;&#1083;&gt;|&lt;&#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&gt;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;&gt; ::= (&lt;&#1090;&#1077;&#1088;&#1084;&#1099;&gt;)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;&#1090;&#1077;&#1088;&#1084;&#1099;&gt; ::= &lt;&#1087;&#1091;&#1089;&#1090;&#1086;&gt; | &lt;&#1090;&#1077;&#1088;&#1084;&gt;&lt;&#1090;&#1077;&#1088;&#1084;&#1099;&gt;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;&#1087;&#1091;&#1089;&#1090;&#1086;&gt; ::=</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">i-am-variable - &#1080;&#1084;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; "-", "+", "*", "/"...</span>
<span style="color: #51afef;">(</span>+ <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #51afef;">)</span> <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">"+" - &#1080;&#1084;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">"1 2 3" - &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1072;&#1084;&#1080;</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span>a <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">)(</span>b <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #c678dd;">)(</span>c <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;</span>

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074;&#1080;&#1076;&#1072;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(f a b c) - &#1074;&#1099;&#1079;&#1086;&#1074; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">((f x) y) - &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; (f x),</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1090;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090; &#1089; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; y</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1054;&#1089;&#1086;&#1073;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072; - &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; - &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086;</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">pi</span> <span style="color: #da8548; font-weight: bold;">3.1415926</span><span style="color: #51afef;">)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">pi - &#1080;&#1084;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">3.14.. - &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">pi</span> <span style="color: #c678dd;">(</span>* <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #98be65;">(</span>atan <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">define</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">f</span> a b c<span style="color: #c678dd;">)</span> <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1086;&#1087;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;</span>
    <span style="color: #c678dd;">(</span>+ <span style="color: #98be65;">(</span>* <span style="color: #da8548; font-weight: bold;">2</span> a<span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span>/ b c<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(if &lt;&#1074;&#1099;&#1088;&#1072;&#1078; 1&gt;</span>
<span style="color: #5B6268;">;;     </span><span style="color: #5B6268;">&lt;&#1074;&#1099;&#1088;&#1072;&#1078; 2&gt;</span>
<span style="color: #5B6268;">;;     </span><span style="color: #5B6268;">&lt;&#1074;&#1099;&#1088;&#1072;&#1078; 3&gt;)</span>

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1045;&#1089;&#1083;&#1080; &lt;&#1074;&#1099;&#1088;&#1072;&#1078; 1&gt; - &#1083;&#1086;&#1078;&#1100;,</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; (if ...) &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &lt;&#1074;&#1099;&#1088;&#1072;&#1078;3&gt;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(&lt;&#1074;&#1099;&#1088;&#1072;&#1078; 2&gt; &#1085;&#1077; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;), &#1080; &#1085;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;</span>

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">#f - &#1083;&#1086;&#1078;&#1100;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">#t - &#1080;&#1089;&#1090;&#1080;&#1085;&#1072;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">if &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090; &#1080;&#1089;&#1090;&#1080;&#1085;&#1086;&#1081; &#1074;&#1089;&#1077; &#1095;&#1090;&#1086; &#1085;&#1077; &#1083;&#1086;&#1078;&#1100;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example">
2
</pre>


<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> #f <span style="color: #c678dd;">(</span>/ <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span>/ <span style="color: #da8548; font-weight: bold;">10</span> <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

</pre>
</div>

<pre class="example">
2
</pre>


<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> #t <span style="color: #c678dd;">(</span>/ <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span>/ <span style="color: #da8548; font-weight: bold;">10</span> <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(&lt; x y)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(&gt; x y)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(= x y)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&gt;=</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;=</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(/ x y)</span>
<span style="color: #51afef;">(</span>/ <span style="color: #da8548; font-weight: bold;">10</span> <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(quotient x y) - &#1094;&#1077;&#1083;&#1086;&#1077; &#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</span>
<span style="color: #51afef;">(</span>quotient <span style="color: #da8548; font-weight: bold;">30</span> <span style="color: #da8548; font-weight: bold;">7</span><span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example">
4
</pre>


<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(remainder x y) -&gt; &#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1082;</span>
<span style="color: #51afef;">(</span>remainder <span style="color: #da8548; font-weight: bold;">30</span> <span style="color: #da8548; font-weight: bold;">7</span><span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example">
2
</pre>


<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">"&#1086;&#1089;&#1086;&#1073;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;"</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(and e1 e2 ... en) - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; #f &#1077;&#1089;&#1083;&#1080; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1086;&#1076;&#1080;&#1085; ei = #f, &#1080;&#1085;&#1072;&#1095;&#1077; en</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(or ...) - &#1074;&#1077;&#1088;&#1085;&#1077;&#1090; &#1087;&#1077;&#1088;&#1074;&#1086;&#1077; &#1085;&#1077; &#1083;&#1086;&#1078;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</span>


<span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">2</span> #f <span style="color: #c678dd;">(</span>/ <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example">
#f
</pre>
