index.md


<a id="org0163405"></a>

## операторы

    ;; <терм> ::= <атом>|<список>
    ;; <атом> ::= <перем>|<число>|<симол>|<строка>
    ;; <список> ::= (<термы>)
    ;; <термы> ::= <пусто> | <терм><термы>
    ;; <пусто> ::=
    ;; i-am-variable - имя переменной может включать "-", "+", "*", "/"...
    (+ 1 2 3) ;; список
    ;; "+" - имя функции сложения
    ;; "1 2 3" - аргументы
    ;; элементы списка разделяются пробелами

    ((a 1)(b 2)(c 3)) ;; список списков
    
    ;; по умолчанию выражение вида
    ;; (f a b c) - вызов функции
    ;; ((f x) y) - сначала вызывается (f x),
    ;; то, что она вычислит с аргументом y
    ;; Особая форма - первый элемент списка - ключевое слово
    
    (define pi 3.1415926)
    ;; pi - имя переменной
    ;; 3.14.. - значение
    
    (define pi (* 4 (atan 1)))
    
    (define (f a b c) ;; опеределяет функции
        (+ (* 2 a) (/ b c)))
    
    ;; (if <выраж 1>
    ;;     <выраж 2>
    ;;     <выраж 3>)
    
    ;; Если <выраж 1> - ложь,
    ;; значением (if ...) станет значение <выраж3>
    ;; (<выраж 2> не вычисляется), и наоборот
    
    ;; #f - ложь
    ;; #t - истина
    ;; if считает истиной все что не ложь

    (if 1 2 3)

    (if #f (/ 1 0) (/ 10 5))

    (if #t (/ 1 0) (/ 10 5))

    ;; (< x y)
    ;; (> x y)
    ;; (= x y)
    ;; >=
    ;; <=
    ;; (/ x y)
    (/ 10 3)

(quotient x y) - целое деление
(quotient 30 7) -> 4
(remainder x y) -> остаток
(remainder 30 7) -> 2

;; &ldquo;особые формы&rdquo;
(and e1 e2 &#x2026; en) - возвращает #f если хотя бы один ei = #f, иначе en
(or &#x2026;) - вернет первое не ложное значение

(and 1 2 #f (/ 1 0)) -> #f
