index.md
(or (= x 0) (/ 1 0)) - не приведет к ошибке деления на 0, никогда
(not x) - логическое отрицание #f -> #t
not x -> #f, x != #f
вычисления ленивые!
,#+end<sub>example</sub>

,#+begin<sub>src</sub> scheme
(+ 1 2 3)
\#+end<sub>src</sub>

    (+ 1 2 3 4)
    
    (define pi (* 4 (atan 1)))
    
    (define (area r) (* r r))
    
    (define e (exp 1))
    
    (define (hypot x y) (sqrt (+ (* x x) (* y y))))
    ; if всегда в 3 строки
    (define (fac x) (if (= x 0)
                         1 (* (fac (- x 1)) x)))
    
    (define (my-positive? n) (> n 0))
    (define (my-abs x)
      (if (< x 0)
          (-x)
          x))
    
    (define (factorial n)
      (define loop acc i)
      (if (> i n)
          acc
          (loop (* acc i) (+ i 1)))
      (loop 1 1))
    
    (define (my-odd n)
      (= 0 (remainder n 2)))
    
    (define (my-even n)
      (= 1 (remainder n 2)))
    
    
    (my-odd 5)
    (my-even 5)

